<?php

// Массив с эмодзи и соответствующими фактами о Даше
$emojiFactsAboutDasha = [
    '🎨🖌️🖼️' => 'любит рисовать',
    '🎵🎸🎼' => 'играет на гитаре',
    '🏃‍♀️🏋️‍♀️🥇' => 'занимается бегом',
    '📚📖🤓' => 'обожает читать книги',
    '🌱🌿🪴' => 'увлекается садоводством',
    '🍳👩‍🍳🥘' => 'любит готовить',
    '✈️🌍🏞️' => 'обожает путешествовать',
    '🐱🐶🐹' => 'любит животных',
    '🎭🎬🎦' => 'увлекается театром и кино',
    '🧘‍♀️🧠🌟' => 'практикует медитацию',
    '🏊‍♀️🚴‍♀️🤸‍♀️' => 'ведет активный образ жизни',
    '🎨📷🖼️' => 'увлекается фотографией',
    '🧶🧵🧦' => 'любит вязать',
    '🌺🌸🌼' => 'выращивает цветы',
    '🎹🎷🎺' => 'учится играть на разных музыкальных инструментах'
];


// Массив с шуточными фразами для подсказок
$hintJokes = [
    "Хм, дай-ка подумать...",
    "Ага, кажется, я что-то знаю!",
    "Птичка на хвосте принесла...",
    "Шепну тебе по секрету...",
    // Добавьте больше шуточных фраз по желанию
];

// Массив с шутками для частично угаданных слов
$partialGuessJokes = [
    "Ты на верном пути!",
    "Почти попал в яблочко!",
    "Горячо-горячо!",
    "Ого, да ты экстрасенс!",    // Добавьте больше шуток по желанию
];

// Массив с шутками для полностью угаданных ответов
$correctGuessJokes = [
    "Бинго! Ты просто супер!",
    "Вау, да ты настоящий знаток Даши!",
    "Невероятно! Ты угадал!",
    "Потрясающе! Ты точно не подглядывал?",
    // Добавьте больше шуток по желанию
];

// Массив с шутками для неправильных ответов
$wrongGuessJokes = [
    "Упс! Не совсем то...",
    "Близко, но не совсем!",
    "Хорошая попытка, но нет!",
    "Не сдавайся, ты почти у цели!",
    // Добавьте больше шуток по желанию
];

// Массив с шутками для неправильных ответов
$statsJokes = [
    "📊 Внимание! Сводка подвигов и провалов наших героев:",
    "🥁 Барабанная дробь! Представляем вам доску почета (и позора):",
    "🗞️ Свежайшие новости с полей сражений:",
    "🏆 Итак, кто у нас тут в чемпионах, а кто в отстающих?",
    "🔥 Держитесь крепче! Вот она, горячая статистика игроков:",
    "🕵️ Внимание! Секретный отчет о достижениях наших агентов:",
    "👑 Кто на свете всех милее, всех румяней и... очковее?",
    "✉️ Открываем конверт с результатами... *барабанная дробь*",
    "📡 Прямая трансляция из штаба командования. Наши потери и победы:",
    "📺 Внеочередной выпуск новостей: 'Кто есть кто в нашей игре'",
    "🚀 Срочно в номер! Рейтинг восходящих звезд и падающих метеоритов:",
    "🔍 Внимание! Разведка докладывает о текущем положении дел:"
];

